
#include <stdio.h>



int main(int argc, char const *argv[])
{
   int line = 0; //上半行数
	//输入：
	scanf("%d", &line);
    //菱形上半部分的打印：行数 -- line9
	int i = 0;
	for (i = 0; i < line; i++)
	{
		//打印一行，先打印空格，再打印*号
 
		//内嵌for循环 打印空格：
		//上半部分空格规律：
		//			line-1-i：假设行数是7，
		//第一行打印7-1-0=6个空格；第二行打印7-1-1=5个空格……
		int j = 0;
		for (j = 0; j < line-1-i; j++)
		{
			printf(" "); //打印空格
		}
 
		//内嵌第二个for循环 打印*号：
		//上半部分*号规律：
		//			2*i+1：假设行数是7，
		//第一行打印2*0+1个*号；第二行打印2*1+1个*号……
		for (j = 0; j < 2*i+1; j++)
		{
			printf("*"); //打印*号
		}
 
		//打印完一行后就进行换行：
		printf("\n");
	} 

 
	//菱形下半部分的打印：行数 -- line-1
	for (i = 0; i < line-1; i++)
	{
		//打印一行，先打印空格，再打印*号
		
		//内嵌for循环 打印空格：
		//下半部分空格规律：
		//			j<=i：假设行数是7-1=6，
		//第一行打印j=0,i=0,j<=i,1个空格；第二行打印j=0,i=1,j<=i,2个空格……
		int j = 0;
		for (j = 0; j <= i; j++)
		{
			printf(" "); //打印空格
		}
 
		//内嵌第二个for循环 打印*号：
		//下半部分*号规律：
		//		2*(line-1-i)-1：假设行数是7-1=6，
		//第一行打印2*(7-1-0)-1,11个*号；第二行打印2*(7-1-1)-1,9个*号……
		for (j = 0; j < 2*(line-1-i)-1; j++)
		{
			printf("*"); //打印*号
		}
 
		//打印完一行后就进行换行：
		printf("\n");
	} 

    return 0;
}
